skrubis/VX1-esp32-web-interface/src/main.cpp
static void handleCommand() {
  if(!server.hasArg("cmd")) {server.send(500, "text/plain", "BAD ARGS"); return;}

  String cmd = server.arg("cmd");

  digitalWrite(LED_BUILTIN, HIGH);

  if (cmd == "json") {
    if (!OICan::SendJson(server.client()))
      server.send(500, "text/plain", "CAN communication error");
  }
  else if (cmd.startsWith("set")) {
    String str(cmd);
    int nameStart = str.indexOf(' ');
    int valueStart = str.lastIndexOf(' ');
    String name = str.substring(nameStart, valueStart);
    double value = str.substring(valueStart, str.indexOf('\r')).toDouble();
    name.trim();

    switch (OICan::SetValue(name, value)) {
      case OICan::Ok:
        server.send(200, "text/plain", "Set Ok");
        break;
      case OICan::UnknownIndex:
        server.send(200, "text/plain", "Unknown Parameter");
        break;
      case OICan::ValueOutOfRange:
        server.send(200, "text/plain", "Value out of range");
        break;
      case OICan::CommError:
        server.send(200, "text/plain", "CAN communication error");
        break;
    }
  }
  else if (cmd.startsWith("stream")) {
    String str(cmd);
    int samplesStart = str.indexOf(' ');
    int namesStart = str.lastIndexOf(' ');
    int samples = str.substring(samplesStart, namesStart).toInt();

    String names = str.substring(namesStart, str.indexOf('\r'));
    String result = OICan::StreamValues(names, samples);

    server.send(200, "text/plain", result);
  }
  else if (cmd == "save") {
    if (OICan::SaveToFlash()) {
      server.send(200, "text/plain", "Parameters and CAN map saved");
    }
    else {
      server.send(200, "text/plain", "No reply to save command");
    }
  }
  else if (cmd == "stop") {
    if (OICan::StartStop(0)) {
      server.send(200, "text/plain", "Inverter halted");
    }
    else {
      server.send(200, "text/plain", "Stop command failed");
    }
  }
  else if (cmd.startsWith("start")) {
    String str(cmd);
    int modeStart = str.indexOf(' ');
    int opmode = str.substring(modeStart, str.indexOf('\r')).toInt();

    if (OICan::StartStop(opmode)) {
      server.send(200, "text/plain", "Inverter started");
    }
    else {
      server.send(200, "text/plain", "Start command failed");
    }
  }
  else {
    server.send(200, "text/plain", "Unknown command");
  }

  digitalWrite(LED_BUILTIN, LOW);
}

static void handleCanMap() {
  digitalWrite(LED_BUILTIN, HIGH);
  OICan::SetResult res = OICan::Ok;

  if (server.hasArg("add")) {
    res = OICan::AddCanMapping(server.arg("add"));
  }
  else if (server.hasArg("remove")) {
    res = OICan::RemoveCanMapping(server.arg("remove"));
  }
  else if (server.hasArg("edit")) {
    res = OICan::RemoveCanMapping(server.arg("edit"));
    if (res == OICan::Ok)
      res = OICan::AddCanMapping(server.arg("edit"));
  }

  if (res == OICan::Ok)
    OICan::SendCanMapping(server.client());
  else if (res == OICan::CommError)
    server.send(500, "text/plain", "CAN communication error");
  else if (res == OICan::UnknownIndex)
    server.send(500, "text/plain", "Invalid request");
  digitalWrite(LED_BUILTIN, LOW);
}

static void handleUpdate()
{
  static int pages = 0;
  if(!server.hasArg("step") || !server.hasArg("file")) {server.send(500, "text/plain", "BAD ARGS"); return;}
  int step = server.arg("step").toInt();
  String message;
  digitalWrite(LED_BUILTIN, HIGH);

  if (step < 0)
    pages = OICan::StartUpdate(server.arg("file"));
  else {
    while (OICan::GetCurrentUpdatePage() < step) {
      OICan::Loop();
    }
  }

  server.send(200, "text/json", "{ \"message\": \"" + message + "\", \"pages\": " + pages + " }");
  digitalWrite(LED_BUILTIN, LOW);
}

static void handleNodeId()
{
  if(server.hasArg("id") && server.hasArg("canspeed")) {
    int id = server.arg("id").toInt();
    int speed = server.arg("canspeed").toInt();
    OICan::BaudRate baud = speed == 0 ? OICan::Baud125k : (speed == 1 ? OICan::Baud250k : OICan::Baud500k);
    OICan::Init(id, baud, config.getCanTXPin(), config.getCanRXPin());
  }
  else if(server.hasArg("id")) {
    int id = server.arg("id").toInt();
    OICan::Init(id, OICan::Baud500k, config.getCanTXPin(), config.getCanRXPin());
  }

  server.send(200, "text/plain", String(OICan::GetNodeId()) + "," + String(OICan::GetBaudRate()));
}

static void handleSettings()
{
  bool updated = true;
  if(server.hasArg("canRXPin") && server.hasArg("canRXPin")  && server.hasArg("canEnablePin"))
  {
    config.setCanRXPin(atoi(server.arg("canRXPin").c_str()));
    config.setCanTXPin(atoi(server.arg("canTXPin").c_str()));
    config.setCanEnablePin(atoi(server.arg("canEnablePin").c_str()));

    config.saveSettings();
    OICan::Init(OICan::GetNodeId(), OICan::GetBaudRate(), config.getCanTXPin(), config.getCanRXPin());


    if (config.getCanEnablePin() > 0) {
      pinMode(config.getCanEnablePin(), OUTPUT);
      digitalWrite(config.getCanEnablePin(), LOW);
    }
  }
  else
  {
    File file = SPIFFS.open("/settings.html", "r");
    String html = file.readString();
    file.close();
    html.replace("%canRXPin%", String(config.getCanRXPin()).c_str());
    html.replace("%canTXPin%", String(config.getCanTXPin()).c_str());
    html.replace("%canEnablePin%", String(config.getCanEnablePin()).c_str());

    server.send(200, "text/html", html);
    updated = false;
  }

  if (updated)
  {
    File file = SPIFFS.open("/settings-updated.html", "r");
    server.streamFile(file, getContentType("settings-updated.html"));
    file.close();
  }
}


static void handleWifi()
{
  bool updated = true;
  if(server.hasArg("apSSID") && server.hasArg("apPW"))
  {
    WiFi.softAP(server.arg("apSSID").c_str(), server.arg("apPW").c_str());
  }
  else if(server.hasArg("staSSID1") && server.hasArg("staPW1"))
  {
    config.setWifiSSID1(server.arg("staSSID1").c_str());
    config.setWifiPassword1(server.arg("staPW1").c_str());
    
    if(server.hasArg("staSSID2") && server.hasArg("staPW2")) {
      config.setWifiSSID2(server.arg("staSSID2").c_str());
      config.setWifiPassword2(server.arg("staPW2").c_str());
    }
    
