skrubis/VX1-esp32-web-interface/src/main.cpp
    if(server.hasArg("wifiEnabled")) {
      config.setWifiEnabled(server.arg("wifiEnabled") == "true");
    }
    
    if(server.hasArg("retryInterval")) {
      config.setWifiRetryInterval(server.arg("retryInterval").toInt());
    }
    
    config.saveSettings();
    
    // Restart WiFi connection process
    wifi_retry_tick.detach();
    currentWifiNetwork = 0;
    wifiConnecting = false;
    
    if (config.getWifiEnabled()) {
      tryConnectWifi();
      wifi_retry_tick.attach(config.getWifiRetryInterval(), wifiRetryCheck);
    }
  }
  else if(server.hasArg("staSSID") && server.hasArg("staPW"))
  {
    // Legacy single WiFi support
    config.setWifiSSID1(server.arg("staSSID").c_str());
    config.setWifiPassword1(server.arg("staPW").c_str());
    config.saveSettings();
    
    WiFi.mode(WIFI_AP_STA);
    WiFi.begin(server.arg("staSSID").c_str(), server.arg("staPW").c_str());
  }
  else
  {
    File file = SPIFFS.open("/wifi.html", "r");
    String html = file.readString();
    file.close();
    html.replace("%staSSID%", WiFi.SSID());
    html.replace("%staSSID1%", config.getWifiSSID1());
    html.replace("%staSSID2%", config.getWifiSSID2());
    html.replace("%apSSID%", WiFi.softAPSSID());
    html.replace("%staIP%", WiFi.localIP().toString());
    html.replace("%wifiEnabled%", config.getWifiEnabled() ? "checked" : "");
    html.replace("%retryInterval%", String(config.getWifiRetryInterval()));
    server.send(200, "text/html", html);
    updated = false;
  }

  if (updated)
  {
    File file = SPIFFS.open("/wifi-updated.html", "r");
    server.streamFile(file, getContentType("wifi-updated.html"));
    file.close();
  }
}


static void handleBaud()
{
  if (fastUart)
    server.send(200, "text/html", "fastUart on");
  else
    server.send(200, "text/html", "fastUart off");
}

void staCheck(){
  sta_tick.detach();
  if(!(uint32_t)WiFi.localIP()){
    WiFi.mode(WIFI_AP); //disable station mode
  }
}

void tryConnectWifi() {
  if (!config.getWifiEnabled()) {
    return;
  }
  
  const char* ssid = (currentWifiNetwork == 0) ? config.getWifiSSID1() : config.getWifiSSID2();
  const char* password = (currentWifiNetwork == 0) ? config.getWifiPassword1() : config.getWifiPassword2();
  
  // Skip if SSID is empty
  if (strlen(ssid) == 0) {
    currentWifiNetwork = (currentWifiNetwork + 1) % 2;
    return;
  }
  
  DBG_OUTPUT_PORT.printf("Attempting to connect to WiFi network %d: %s\n", currentWifiNetwork + 1, ssid);
  WiFi.mode(WIFI_AP_STA);
  WiFi.begin(ssid, password);
  wifiConnecting = true;
  lastWifiAttempt = millis();
}

void wifiRetryCheck() {
  if (!config.getWifiEnabled()) {
    wifi_retry_tick.detach();
    return;
  }
  
  wl_status_t status = WiFi.status();
  
  // If we're connected, we're done
  if (status == WL_CONNECTED) {
    wifiConnecting = false;
    DBG_OUTPUT_PORT.printf("WiFi connected to %s, IP: %s\n", WiFi.SSID().c_str(), WiFi.localIP().toString().c_str());
    return;
  }
  
  // If we're still connecting and haven't timed out, wait
  if (wifiConnecting && (millis() - lastWifiAttempt < 15000)) {
    return;
  }
  
  // Connection failed or timed out, try next network
  if (wifiConnecting) {
    DBG_OUTPUT_PORT.printf("WiFi connection to network %d failed\n", currentWifiNetwork + 1);
    wifiConnecting = false;
    currentWifiNetwork = (currentWifiNetwork + 1) % 2;
  }
  
  // Try to connect to the next available network
  tryConnectWifi();
}

void setup(void){
  DBG_OUTPUT_PORT.begin(115200);
  //Inverter.setRxBufferSize(50000);
  //Inverter.begin(115200, SERIAL_8N1, INVERTER_RX, INVERTER_TX);
  //Need to use low level Espressif IDF API instead of Serial to get high enough data rates
  uart_config_t uart_config = {
        .baud_rate = 115200,
        .data_bits = UART_DATA_8_BITS,
        .parity    = UART_PARITY_DISABLE,
        .stop_bits = UART_STOP_BITS_1,
        .flow_ctrl = UART_HW_FLOWCTRL_DISABLE,
        .rx_flow_ctrl_thresh = UART_HW_FLOWCTRL_DISABLE,
        .source_clk = UART_SCLK_APB};

  uart_param_config(INVERTER_PORT, &uart_config);
  uart_set_pin(INVERTER_PORT, INVERTER_TX, INVERTER_RX, UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE);
  uart_driver_install(INVERTER_PORT, SDIO_BUFFER_SIZE * 3, 0, 0, NULL, 0); //x3 allows twice card write size to buffer while writes
  delay(100);

  pinMode(LED_BUILTIN, OUTPUT);

  //check for external RTC and if present use to initialise on-chip RTC
  if (ext_rtc.begin())
  {
    haveRTC = true;
    DBG_OUTPUT_PORT.println("External RTC found");
    if (! ext_rtc.initialized() || ext_rtc.lostPower())
    {
      DBG_OUTPUT_PORT.println("RTC is NOT initialized, setting to build time");
      ext_rtc.adjust(DateTime(F(__DATE__), F(__TIME__)));
    }

    ext_rtc.start();
    DateTime now = ext_rtc.now();
    int_rtc.setTime(now.unixtime());
  }
  else
    DBG_OUTPUT_PORT.println("No RTC found, defaulting to sequential file names");

  //initialise SD card with graceful fallback and timeout
  DBG_OUTPUT_PORT.println("Initializing SD card...");
  
  // Set pins for SDMMC interface
  // This is a workaround since we can't pass pins directly to SD_MMC.begin()
  pinMode(SD_CLK, INPUT_PULLUP);
  pinMode(SD_CMD, INPUT_PULLUP);
  pinMode(SD_DAT0, INPUT_PULLUP);
  pinMode(SD_DAT1, INPUT_PULLUP);
  pinMode(SD_DAT2, INPUT_PULLUP);
  pinMode(SD_DAT3, INPUT_PULLUP);
  
  // Use a timeout for SD card initialization to prevent hanging
  
  // First try: 1-bit SDIO mode (more compatible)
  DBG_OUTPUT_PORT.println("Trying 1-bit SDIO mode...");
  bool sdBeginResult = false;
  
  // Set a task that will abort SD initialization if it takes too long
  Ticker sdTimeout;
  sdTimeout.once(5, []() {
    SD_MMC.end();
    DBG_OUTPUT_PORT.println("SD card initialization timeout!");
  });
  
  sdBeginResult = SD_MMC.begin("/sdcard", true, false, 40000, 5U);
  sdTimeout.detach(); // Cancel the timeout
  
  if (sdBeginResult) {
    uint64_t cardSize = SD_MMC.cardSize() / (1024 * 1024);
    uint64_t freeSpace = (SD_MMC.totalBytes() - SD_MMC.usedBytes()) / (1024 * 1024);
    DBG_OUTPUT_PORT.println("SD Card initialized in 1-bit SDIO mode");
    DBG_OUTPUT_PORT.printf("SD Card Size: %llu MB\n", cardSize);
    DBG_OUTPUT_PORT.printf("Free Space: %llu MB\n", freeSpace);
    haveSDCard = true;
  }
  // Second try: SPI mode fallback
  else {
    DBG_OUTPUT_PORT.println("SDIO mode failed, trying SPI mode...");
    SD_MMC.end();
    delay(500); // Give some time for cleanup
    
    // Set a timeout for SPI mode initialization
    sdTimeout.once(5, []() {
      SD.end();
      DBG_OUTPUT_PORT.println("SD card SPI initialization timeout!");
    });
    
    if (SD.begin(SD_DAT3)) { // Using CS pin (SD_DAT3/SS)
      sdTimeout.detach(); // Cancel the timeout
      uint64_t cardSize = SD.cardSize() / (1024 * 1024);
      uint64_t totalBytes = SD.totalBytes();
      uint64_t usedBytes = SD.usedBytes();
      uint64_t freeSpace = (totalBytes - usedBytes) / (1024 * 1024);
      
      DBG_OUTPUT_PORT.println("SD Card initialized in SPI mode");
      DBG_OUTPUT_PORT.printf("SD Card Size: %llu MB\n", cardSize);
      DBG_OUTPUT_PORT.printf("Free Space: %llu MB\n", freeSpace);
      haveSDCard = true;
    }
    else {
      sdTimeout.detach(); // Cancel the timeout
      DBG_OUTPUT_PORT.println("SD Card initialization failed in all modes");
      haveSDCard = false;
    }
  }
  
  DBG_OUTPUT_PORT.println("SD card initialization complete.");

  //Start SPI Flash file system
  SPIFFS.begin();

  // Load configuration first
  config.load();

  //WIFI INIT
  #ifdef WIFI_IS_OFF_AT_BOOT
    enableWiFiAtBootTime();
  #endif
  WiFi.mode(WIFI_AP_STA);
  //WiFi.setPhyMode(WIFI_PHY_MODE_11B);
  WiFi.setSleep(false);
  WiFi.setTxPower(WIFI_POWER_19_5dBm);//25); //dbm
  
  // Start WiFi retry mechanism
  if (config.getWifiEnabled()) {
    tryConnectWifi();
    wifi_retry_tick.attach(config.getWifiRetryInterval(), wifiRetryCheck);
  }
  
  sta_tick.attach(10, staCheck);

  MDNS.begin(host);

  if (config.getCanEnablePin() > 0) {
    pinMode(config.getCanEnablePin(), OUTPUT);
    digitalWrite(config.getCanEnablePin(), LOW);
  }

  OICan::Init(1, OICan::Baud500k, config.getCanTXPin(), config.getCanRXPin());

  updater.setup(&server);

  //SERVER INIT
  ArduinoOTA.setHostname(host);
  ArduinoOTA.begin();
  //list directory
  server.on("/list", HTTP_GET, handleFileList);

  server.on("/rtc/now", HTTP_GET, handleRTCNow);
  server.on("/rtc/set", HTTP_POST, handleRTCSet);
  server.on("/sdcard/list", HTTP_GET, handleSdCardList);
  server.on("/sdcard/deleteAll", HTTP_GET, handleSdCardDeleteAll);

  //load editor
  server.on("/edit", HTTP_GET, [](){
    if(!handleFileRead("/edit.htm")) server.send(404, "text/plain", "FileNotFound");
  });
  //create file
  server.on("/edit", HTTP_PUT, handleFileCreate);
  //delete file
  server.on("/edit", HTTP_DELETE, handleFileDelete);
  //first callback is called after the request has ended with all parsed arguments
  //second callback handles file uploads at that location
  server.on("/edit", HTTP_POST, [](){ server.send(200, "text/plain", ""); }, handleFileUpload);

